Tekla.Structures.ModelInternal.Operation.IFCExportFlags.IsLocationFromBuildingHierarchy
Get locations from Building Hierarchy.

Tekla.Structures.ModelInternal.Operation.IFCExportFlags.ExportRebarSetGroupAsIndividualBars
Rebar set group individual bars export is enabled.